luckynumber/trunk/app/controllers/predict_controller.rb

SELECT * FROM `results` WHERE (date='25-11-2011') LIMIT 1
---
  def index
    date = params[:date] || current_date
    date2 = nil
    begin
      d = Time.parse(date)
      date = format_date(d)
      date2 = format_date2(d)
    rescue
      render :text => '' and return
    end

    result = Result.find(:first, :conditions => "date='#{date}'")